<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="main.xsl"?>
<!DOCTYPE document SYSTEM "document.dtd">

<document header="お気に入りについて">


<group header="表示">
  <sentence>
  板、スレ、画像に関してお気に入りの登録が可能。左サイドバーのコンボボッ
  クスでお気に入りを選ぶか、メインツールバーのお気に入りボタンを押すとお
  気に入りビューが表示される。
  </sentence>
</group>


<group header="編集">
  <sentence>
  お気に入りはドラッグ&amp;ドロップで直接編集可能。
  ctrl+クリック、または中ボタンドラッグで複数行を選択することが出来る。
  編集内容はCtrl+z、又はCtrl+/で元に戻す(Undo)、Ctrl+Z(大文字)でやり直し(Redo)が可能。
  </sentence>
  <sentence>
  また、ツールメニュー → お気に入りの編集からお気に入り編集ウィンドウを開く。
  お気に入り編集ウィンドウ上では項目をクリックしてもビューを開かないので簡単にお気に入りを編集することができる。
  さらに、お気に入り編集ウィンドウとサイドバーのお気に入りの間で相互にドラッグ&amp;ドロップすることも可能。
  </sentence>
  <sentence>
  なお、お気に入りの設定ファイル(キャッシュディレクトリ内にあるbookmark.xml)はXML形式なので手動で編集することも可能だが推奨しない。
  </sentence>  
</group>


<group header="登録">
  <sentence>以下のいずれかを行う。</sentence>

  <list type="circle">
    <item>スレ一覧やスレなどの各ビューのタブをサイドバーのお気に入り(または編集ウィンドウ)にドラッグ&amp;ドロップ</item>
    <item>各ビューのツールバーにある「お気に入りに追加」ボタンを押す。またはCtrl+dを押す。すると挿入先ダイアログが表示されるので挿入先を選んでOKを押す。</item>
    <item>スレ一覧でctrl+クリック(または中ボタンドラッグ)で複数のスレを選択 -> サイドバーのお気に入り(または編集ウィンドウ)にドラッグ&amp;ドロップ</item>
    <item>スレ一覧でctrl+クリック(または中ボタンドラッグ)で複数のスレを選択 -> 右クリック -> 「お気に入りに追加」を選択</item>
    <item>画像アイコンをサイドバーのお気に入り(または編集ウィンドウ)にドラッグ&amp;ドロップ</item>
    <item>画像ビューで右クリック -> 「お気に入りに追加」を選択</item>
    <item>画像ビューでCtrl+dを押して挿入先ダイアログを表示</item>
  </list>
</group>


<group header="削除">

  <sentence>削除したい行を選択してから右クリックして削除を選択するかdeleteを押す。
  </sentence>

  <sentence>複数の行を削除したい場合は以下のいずれかを行う。</sentence>

  <list type="circle">
    <item>サイドバーのお気に入り(または編集ウィンドウ)にでctrl+クリック(または中ボタンドラッグ)で複数行を選択 -> 右クリック -> 削除</item>
    <item>サイドバーのお気に入り(または編集ウィンドウ)にでctrl+クリック(または中ボタンドラッグ)で複数行を選択 -> delete キー</item>
  </list>
</group>


<group header="仮想板">
  <sentence>
  お気に入りに登録したスレ(及びスレ履歴と閉じたスレ履歴)は仮想板としてスレ一覧に一覧表示することが可能である。
  </sentence>

  <sentence>
  お気に入りに登録されたスレを全て表示するにはツールメニューの「サイドバーをスレ一覧に表示」を選択する。
　また「サイドバーの仮想板を作成」を選択するとお気に入りにショートカットを作成して普通の板の様に操作することが出来る。
  </sentence>

  <sentence>
   お気に入りのディレクトリの中に登録したスレをスレ一覧に表示するには、ディレクトリの上で右クリックしてメニューを
　表示し、「ディレクトリをスレ一覧に表示」を選択する。また「仮想板作成」を選択するとお気に入りにショートカットを
  作成して普通の板の様に操作することが出来る。
  </sentence>  

</group>



</document>
